app/controllers/comments_controller.rb

  def find_article
    @article_id = params[:article_id]
    return (redirect_to(articles_path)) unless @article_id
    @article = Article.find(@article_id)
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)